In [1]:
import pandas as pd
dict1 ={'Student Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,82],
               }
df1=pd.DataFrame(dict1)

In [5]:
df1['Student Name']

0    Priyang
1     Aadhya
2     Krisha
3     Vedant
4     Parshv
5     Mittal
6    Archana
Name: Student Name, dtype: object

In [6]:
df1[['Student Name','Marks']]

  Student Name  Marks
0      Priyang     98
1       Aadhya     89
2       Krisha     99
3       Vedant     87
4       Parshv     90
5       Mittal     83
6      Archana     82

In [10]:
df1.Student Name

SyntaxError: invalid syntax (1145130898.py, line 1)

we cannot access the student name column beacuse there is a space in the heading so in these dot notations gives invalid syntax so we have to use brackets

In [12]:
df1.Marks

0    98
1    89
2    99
3    87
4    90
5    83
6    82
Name: Marks, dtype: int64

marks donot have space in cloumn so we can use either brackets or dot notation